[
  {
    "ord": 1,
    "category": "dance",
    "colour": "pink",
    "name": "Sarah Sordoni",
    "title": "Owner/Director of Dance",
    "photo": "./img/faculty/dance/ss01.jpg",
    "bio": "<p>Sarah is an inspiring, compassionate and successful dance educator and business woman who has been an instrumental part of arts education in her community.  As a young dancer she trained at the prestigious Quinte Ballet School and she is an Honours graduate, obtaining a Bachelor of Fine Arts Degree from Ryerson University in Toronto, Ontario, Canada. Sarah is the Co-Owner of The Dream Centre and the Director of the Live Dream Dance recreational and competitive programming within the facility. Sarah has grown her dance studio from 50 students in two small rooms to a 20,000 sq/ft indoor sports facility with classes in dance, gymnastics, martial arts, musical theatre, adult fitness, before and after school care and post partum programs for Moms. Her successful business model now services thousands and employs nearly 30 faculty members. Before taking on the role of business owner, Sarah’s performing arts career led her to some incredible opportunities to dance and perform in shows such as: Cinderella, Little Red Riding Hood, Beauty and the Beast and Cats to name a few. Sarah is also an accomplished pianist, as well as, a singer who was a lead singer for a Jazz Big Band that travelled throughout North America. As a dance educator, Sarah’s students train hard and achieve immense success. Sarah’s elite competition dance team has won numerous accolades such as: National and International Solo Titles, Top Scoring Group Routines, Top Choreography, Top Studio Awards, as well as, several gold, silver and bronze medals at The Dance World Cup in both Spain and Portugal and World Tap Championships in Germany.</p><p>Sarah’s most current project is a content author for the LEAP dance platform, Live Dream Dance which is a recreational dance curriculum available to dance educators around the globe.  Sarah wishes all of the students at TDC an incredible year in dance and arts education!</p>"
  },
  {
    "ord": 3,
    "category": "dance",
    "colour": "pink",
    "name": "Catina Duscio",
    "title": "Competitive Dance Co-Director",
    "photo": "./img/faculty/dance/cd01.jpg",
    "bio": "<p>Catina Duscio has devoted the past eleven years to encouraging and training young artists. She is recognized as an outstanding technician in all dance genres. From pointe shoes to hip hop, her strengths have proved to have no boundaries as a performer, instructor and choreographer. Miss. Duscio’s true joy is bringing her creativity, experience and technical skill to the stage for an audience to enjoy and into the classroom where she can challenge and excite her students. By focusing on the technique that stems from the base of ballet to encouraging students to push artistic boundaries, there are no limits in the classroom.</p><p>Catina is endlessly striving for new inspiration and creating work exuding passion and emotion. Catina has directed, instructed and choreographed for many studios, workshops and respected educational institutions over the years with great success including The Queen Street Conservatory, Etobicoke School of the Arts, St. John’s Kilmarnock School, Meyerhofer Academy of the Performing Arts, Jo-Ann Adams School of Dance, Crystal Lake Conservatory, District Dance Company, Premier Dance Academy, Breaking Bounds Dance Challenge, Storyteller Dance Studio and is now Recreational Program Manager and Competitive Dance Choreographer at Live Dream Dance - The Dream Centre. Over the years as a performer as well as a teacher and choreographer, her competitive work has received numerous entertainment, choreography, high score and overall awards at competitions across Canada and the USA. Catina has had the opportunity to be a part of many movies, television shows and live shows such as; Canadian Music Week, Teenz Fav, Youth Day, LMFAO Canadian Tour, Hellcats, L.A. Complex, Frenemies, Suits, Nakita and Monster High, to name a few. Catina trained under Gwen Fleisch obtaining distinction on all R.A.D ballet exams and continues to train young dancers in exam preparation and performances. Catina is a member of the Professional Adjudicators Alliance, has completed her Canada YPAD (Youth Protection Advocates in Dance) Studio Certification Course for Individuals, Choreographers and Dance Professionals. She is also certified in BLS CPR from the American Academy of CPR & First Aid, Inc, a Certified Progressing Ballet Technique (PBT) Instructor and has continued her education with Alixa Flexibility (Module 1 and 2).</p><p>Catina is one of the main singers/recording artists of the pop duo High Diamond alongside her sister Angela. The duo has performed and/or collaborated with artists such Red Foo (LMFAO), Vita Chambers, Roy Hamilton, Fito Blanko etc. As well as Jeff Dimitriou/JDX Entertainment who is the duo’s official choreographer and artistic director. The duo’s single ‘Broken’ making it to the Top 100 charts in Canada and later being signed to a distribution deal with Universal Music. High Diamond is set to release their new single ‘Hit The Floor’ featuring artist Fito Blanko. While we wait for the release of ‘Hit The Floor’, you can find more of High Diamond’s original music in the new cartoon ‘Spike Team’ launched worldwide! Watch season 3 to see the introduction of High Diamond’s characters and music for the first time on national television!</p><p>Catina’s demand for quality alongside her very approachable personality gives her the ability to encourage and motivate her students at every age and level and push them beyond their comfort zone to be the very best they can be.</p><p>Catina feels in order to keep current, in shape and prepared, she must continue to train in dance, vocal and acting, She believes in experiencing as much as possible to enrich her life and feed her passion for the art of dance and music. Catina is always excited to share everything she knows in the hopes of inspiring others.</p>"
  },
  {
    "ord": 5,
    "category": "dance",
    "colour": "pink",
    "name": "David Cox",
    "title": "Tap",
    "photo": "./img/faculty/dance/dc01.jpg",
    "bio": "<p>David Cox has been dancing since the age of 2, as he was brought into this world by a musical family. His father a Motown artist and his mother a dance teacher. At 13 he made his first trip to NYC on scholarship and that would change his life forever. Studying with some of the best dancers in the world he began to realize that tap dance was his passion not forgetting his extensive training in jazz, ballet and modern. Since becoming a professional he has gone on to perform for and at the following: YTV Achievement Award Winner 1999 Dance Category, \"Bojangles\" the Showtime movie starring Gregory Hines, the international sensation 'STOMP', Juno Awards, Toronto International Film Festival, Vancouver Jazz Festival, The Duke Ellington Society, Save The Last Dance pt2, talked Tap and Tapped with Shelagh Rogers (Sounds Like Canada CBC Radio 1) , Bravo Fact 'The Hoofers Club', Dance Arts Vancouver & Judith Marcuse Projects (ICE: Beyond Cool, FIRE... Where There's Smoke, and EARTH=HOME), ADIDAS, Pro Arte Danza's The Jazz Cracker, Ballet Creole's Soulful Messiah, Ruckus Co Prod's Ricochet, LKTYP's \"i think i can\", Hoofers House Harlem NYC. Numerous corporate functions include former T.O Mayor David Miller's Inaugural Ball, Coca Cola, Hit N Run Productions and has performed for the speaker of the house, and His Majesty Prince Charles to name a few. He has been on MTV Canada as a choreographer and dancer for \"MTV Live: Dancing with the Hosts\" and Much Music's Black History Month. David has shared his passion with the world as a featured performer in the Vancouver 2010 Winter Olympic Games Opening Ceremonies and is a sought after adjudicator and teacher across North America. He is also proud to be a member of a band called Theatre Crisp where he taps as added percussion. He is regular faculty at the Tap Dance Centre in Mississauga among other surrounding area studios. His happy go lucky and energetic attitude is contagious to those around him, and urges others to pick up a tap and discover the music they can make. Here's to the 2nd Balcony...Keep it Copasetic!</p>"
  },
  {
    "ord": 6,
    "category": "dance",
    "colour": "pink",
    "name": "Kayleigh Neddow",
    "title": "Ballet, Jazz, Lyrical and Contemporary",
    "photo": "./img/faculty/dance/kn01.jpg",
    "bio": "<p>Kayleigh has been teaching since the age of sixteen, sharing her knowledge and creative spark with all students. Her students and choreography have competed and won a number of special awards and over all titles at many competitions. Kayleigh completed her Bachelor of Arts Degree in the dance division at Point Park University, Conservatory of the Arts in Pittsburgh, Pennsylvania with scholarship training intensively through all forms of dance. The prestigious Point Park Conservatory has opened many opportunities working with elite choreographers. She participated in Point Park International Summer Intensive six-week program taught by internationally recognized artists.</p><p>Kayleigh attended intensive training for four weeks with The Quinte Ballet School of Canada and was accepted into their professional full-time program. She has successfully completed ballet exams through the Society of Russian Ballet (Vaganova). She has received numerous awards and scholarships including the position of iDance protege and senior Hall of Fame Inductee. Kayleigh has traveled to represent Canada on the World Canadian Showedance Team in Germany as well as the International Dance Organization’s world Championships for jazz and ballet. Kayleigh is always looking for opportunities to further educate herself and students. She loves to watch her students thrive, and is excited share her knowledge and experiences with the students.</p>"
  },
  {
    "ord": 7,
    "category": "dance",
    "colour": "pink",
    "name": "Anthony Smith",
    "title": "Hip Hop",
    "photo": "./img/faculty/dance/as01.jpg",
    "bio": "<p>With over 15 years’ experience in the dance industry, Ambitious Anthony does nothing less than inspire every dancer he works with. In March of 2010, he created Ambitious Movement (AM). His vision was to bring professional trainers in street dance (Waving, Popping, Tutting, Breaking, House, party dances) mixed with his hip-hop choreography to dancers, developing a strong foundation in hip-hop and street dance technique. Since then AM was the runner up of Much Music's New.Music.Live Best Dance Crew, has featured dancers on the 2018 iHeartRadio Much Music Video Awards, the Family Channel’s “The Next Step”, Xbox's Dance Central commercial, a Toronto Public Health commercial, a Chapman’s Ice Cream commercial, WE Day Toronto and the hype crew for New Year’s Eve 2014 at Mississauga’s Celebration Square.</p><p>In addition, Ambitious Anthony has choreographed and artistically directed eleven theatre productions and numerous corporate events for companies including Nike, Walmart, Hugo Boss and Diet Pepsi Max, to name a few. He has also choreographed for local artists and has opened for artists such as T-Pain, Ciara and Ludacris.</p><p>\"Why settle for less? Be ambitious!\" This is not only his company slogan, but his way of life that he aims to pass on to every dancer he works with.</p>"
  },
  {
    "ord": 11,
    "category": "dance",
    "colour": "pink",
    "name": "Kaelyn Hine",
    "title": "Competitive and Recreational Dance Assistant",
    "photo": "./img/faculty/dance/kh01.jpg",
    "bio": "<p>Kaelyn is a grade 10 honours student. She started dance when she was 4 years old and has been a competitive dancer since she was 7. She has received several special awards, placed overall and won scholarships over the years. Dance is Kaelyn's passion.  Not only is it physically challenging but it allows her to express herself. It brings her so much joy watching the younger students learn and grow.  She loves dancing and teaching at TDC!</p>"
  },
  {
    "ord": 13,
    "category": "dance",
    "colour": "pink",
    "name": "Emma Turgeon",
    "photo": "./img/faculty/dance/et01.jpg",
    "title": "Competitive and Recreational Dance Assistant",
    "bio": "<p>Emma started dancing at The Dream Center at five years old and has been part of the competitive team since the age of nine. Dancing at TDC competitively has given Emma the opportunities to attend the NBS summer program, be part of the World Performers national team, and most recently she got accepted to the Apprentice division of The Rhythm Ensemble. Emma loves all styles of dance, but her favourites are Tap and Hip Hop. Outside of dance, Emma loves using her artistic skill to paint and draw. She will be a teaching intern for two classes this year and looks forward to helping students enjoy their time at The Dream Center.</p>"
  },
  {
    "ord": 1,
    "category": "theatre",
    "colour": "red",
    "name": "Jo Payne",
    "photo": "./img/faculty/theatre/jp.jpg",
    "title": "Star Project Director",
    "bio": "<p>Jo is a British Director and Performer and owner of The Star Project.</p><p>Jo graduated from The Midlands Academy of Dance and Drama, Nottingham, UK with a distinction in 2006, along with her Teaching Associate qualification with IDTA. Since then Jo has had extensive professional experience within the arts with credits in TV, film and theatre. Travelling to Paris, Edinburgh and now Canada with her work.</p><p>After graduating it was Jo’s vision to create a happy and inspiring theatre school that had a family atmosphere in the area where she had grown up. Jo’s vision was a place where children could discover and grow their talents, build confidence and learn skills every week where she and her team could “capture their imagination”.</p><p>Over 13 years later and The Star Project has welcomed over a thousand children through its doors. As SP continues to flourish, Jo runs the first international franchise of that school here at The Dream Centre with Musical Theatre classes along with continuing to write and create new material for theatre and her other venture ZOOMSICAL. www.zoomsical.co.uk</p>"
  },
  {
    "ord": 1,
    "category": "gymnastics",
    "colour": "purple",
    "name": "Brittany Berezowski",
    "photo": "./img/faculty/gymnastics/bb.jpg",
    "title": "Gymnastics & Ninja Warrior Director, COO",
    "bio": "<p>Brittany has been coaching gymnastics since 2005 and has had the opportunity to work with gymnasts from beginner to national level. She has also worked with athletes in cheerleading, dance, figure skating delivering specific athletic training needs. She was a judge for the Ontario Developmental Program (ODP) for 7 years. Since 2016, she has expanded her focus towards online education and program development for coaches to be able to provide quality coaching while incorporating a positive mindset. She has held clinics in both US and Canada.</p><p>Brittany has a bachelor’s degree in Applied Science (BASc) and a diploma as a Social Service Worker (SSW). She is also a Certified Personal Trainer through the National Academy Of Sports Medicine (NASM), certified in First Aid/CPR. Brittany studied in a variety of different areas such as sociology, psychology, counselling, and mediation which allows for a higher quality of coaching. She has experience working with children outside of sport as well, such as elementary schools and long-term care homes. She has a substantial amount of experience working with children and adults with exceptional needs.</p><p>Brittany did gymnastics in her youth and then moved into fitness later on in life. She grew up training as an opera singer and travelled US, Canada and Europe to sing. She participated in many operas, broadway productions, musicals, and other performances over the years. In her spare time, she enjoys cooking, doing puzzles and writing.</p><p>As a coach, one of Brittany’s most important values is to always see progress. Whether that be physical or emotional, she does her best to make sure her athletes and coaches are always progressing in some way. Her consistent and positive demand for quality and focus allows her to successfully guide each athlete to reach their highest potential.</p>"
  },

  {
    "ord": 2,
    "category": "gymnastics",
    "colour": "purple",
    "name": "Shannon Cooper",
    "photo": "./img/faculty/gymnastics/sc.jpg",
    "title": "Recreational & Pre-Competitive Gymnastics Coach, Gym Supervisor",
    "bio": "<p>Shannon has been a coach for over twenty years. She grew up training as a competitive gymnast and Trampolinist. She has been coaching in our recreational and pre-competitive programs at the Dream Centre since 2015.</p><p>Shannon has a College Diploma in Recreation and Leisure Services and her certifications and accomplishments include: Level 1&2 NCCP coaching in Gymnastics, Trampoline and Tumbling. She is also a Registered Reflexologist and Reiki Practitioner. Shannon has a cross trained in a variety of other sports including, dance, cheerleading, soccer, hockey and snowboarding. In her spare time she loves to paint.</p>"
  },
  {
    "ord": 4,
    "category": "gymnastics",
    "colour": "purple",
    "name": "Chloe Henson",
    "photo": "./img/faculty/gymnastics/chh.jpg",
    "title": "Recreational & Pre-Competitive Gymnastics Coach, Ninja Warrior Coach",
    "bio": "<p>Chloe was a competitive dancer at The Dream Centre from the ages of 7-13. Following competitive dance, she started volunteering in the gymnastics program. Chloe has been an amazing and committed coach since 2017.  She has recently grown into teaching our new Ninja Warrior program as well as our pre-competitive gymnasts.</p><p>Chloe is currently an honours student at Glendale Secondary School in their audition based performing arts program.</p><p>Chloe is a certified gymnastics coach and has attained her First Aid/CPR certification. Chloe’s strong leadership skills bring quality to her classes and help the kids grow and progress throughout the season. Her goal is to put a smile on all of their faces and make sure they have fun. She is excited to grow with the Dream Centre this year.</p>"
  },
  {
    "ord": 5,
    "category": "gymnastics",
    "colour": "purple",
    "name": "Megan Small",
    "photo": "./img/faculty/gymnastics/ms.jpg",
    "title": "Recreational Gymnastics Coach",
    "bio": "<p>Megan is an honours student at Waterdown District High School. She hopes to study Sciences and/or Sports Management in University. Megan has been a gymnast since she was 3 years old and has been involved in a variety of other sports such as ballet, dance, tennis, rock climbing and other fitness programs. She is also a certified rock climbing coach. She has been coaching gymnastics at the Dream Centre since 2018. Coaching and being a mentor for young children has been a passion of Megan. Her eagerness to learn and inspire shows evidently in her coaching abilities.</p>"
  },
  {
    "ord": 6,
    "category": "gymnastics",
    "colour": "purple",
    "name": "Sarah Visser",
    "photo": "./img/faculty/gymnastics/sv.jpg",
    "title": "Recreational Gymnastics Coach",
    "bio": "<p>Sarah Visser is a certified gymnastics coach and has been a gymnastics coach for over 20 years. She grew up training as a provincial gymnast and has coached both recreational and competitive levels. Her extensive experience in coaching and outgoing personality allows for a fun but progressive class environment. On her spare time, she loves biking, hiking and spending time with family.</p>"
  },
  {
    "ord": 7,
    "category": "gymnastics",
    "colour": "purple",
    "name": "Carina Ferrazzi",
    "photo": "./img/faculty/gymnastics/cf.jpg",
    "title": "Recreational Gymnastics Coach",
    "bio": "<p>Carina is a Grade 12 Honour Roll student. She has been dancing and doing tumbling since the age of four. Carina has won scholarships to the Canadian Dance Expo and multiple awards at various competitions.</p><p>Carina has found her passion in coaching gymnastics and has been teaching at The Dream Centre Since 2018. Carina is excited to pursue her career as a gymnastics coach and works hard every day to inspire and mentor the children in her classes. Her excitement for fitness and health has pushed her to see herself coaching long-term.</p>"
  },
  {
    "ord": 8,
    "category": "gymnastics",
    "colour": "purple",
    "name": "Courtney Hirsch",
    "photo": "./img/faculty/gymnastics/coh.jpg",
    "title": "Recreational Gymnastics Coach",
    "bio": "<p>Courtney is a certified gymnastics and trampoline coach and has been working at the Dream Centre since 2018. She is passionate about teaching and mentoring children. Her outgoing personality brings character and excitement to all of her classes.</p><p>Courtney started out as a competitive gymnast herself and then moved into lyrical dance and circus training on the hoops, silks, hamic and trapeze bars. She has won multiple awards for best tumbling and high scores on each apparatus in gymnastics.</p><p>Courtney graduated with honours at Waterdown District High School. She has volunteered at Allan A Greenleaf School and the Burlington SPCA. On her spare time she enjoys different types of art and loves spending time with her kitten.</p>"
  },
  {
    "ord": 9,
    "category": "gymnastics",
    "colour": "purple",
    "name": "Lauren Inrig",
    "photo": "./img/faculty/gymnastics/li.jpg",
    "title": "Recreational Gymnastics Coach",
    "bio": "<p>Lauren started training at The Dream Centre around the age of 9 in our competitive dance program. Lauren achieved many goals and awards during her training years. One of her biggest accomplishments was being a part of the World Performers National Team in 2019. She started coaching as an assistant in our gymnastics program in 2019 and is now coaching on her own. While formerly focused on her training as an athlete, Lauren is very excited that she can still grow at The Dream Centre, now as a coach.</p>"
  },
  {
    "ord": 10,
    "category": "gymnastics",
    "colour": "purple",
    "name": "Caitlin Huard",
    "photo": "./img/faculty/gymnastics/cah.jpg",
    "title": "Recreational & Pre-Competitive Gymnastics Coach",
    "bio": "<p>Caitlin is a grade 12 honours student and is looking forward to pursuing a career in Kinesiology and Physical Education. She started dance at the age of 3 and moved into gymnastics by 5 years old. Caitlin competed as a provincial level gymnast and ever since then it has been her passion. She has placed in top 3 at many competitions.</p><p>Caitlin is an NCCP certified gymnastics coach as well as trained in First Aid/CPR. Caitlin places great emphasis on quality and technique while coaching based on her experience and passion for the sport. She has been coaching at The Dream Centre since 2018 and looks forward for many years to come.</p>"
  },
  {
    "ord": 11,
    "category": "gymnastics",
    "colour": "purple",
    "name": "Martina Chaulk",
    "photo": "./img/faculty/gymnastics/mc.jpg",
    "title": "Recreational Gymnastics Assistant",
    "bio": "<p>Martina has just started at The Dream Centre as a Recreational Gymnastics Assistant. She is 14 years old and attends St. Mary's High School in Hamilton. Martina has a passion for gymnastics and was part of our pre-competitive gymnastics program when she was younger. She loves working with children and believes that coaching is a great way to continue to share her knowledge and passion with others. She looks forward to an amazing year at The Dream Centre.</p>"
  },
  {
    "ord": 1,
    "category": "martialarts",
    "colour": "blue",
    "name": "Emily Kulpaka",
    "photo": "./img/faculty/martialarts/emily.jpg",
    "title": "Director",
    "bio": "<p>Our program director for Martial Arts started training at 15 years old and never looked back. Competing locally, provincially and internationally for many years, she developed a passion for making connections in the Martial Arts community while honing strong martial arts skills. Miss Emily managed a local Martial arts school and then opened Determination Martial Arts  in Hamilton in 2016, focusing on adaptive and inclusive martial arts. She enthusiastically joined the Dream Centre Team in 2018 and has been working on creating Waterdown Ninjas ever since!</p>"
  },
  {
    "ord": 2,
    "category": "martialarts",
    "colour": "blue",
    "name": "Mersina Giampapa",
    "photo": "./img/faculty/martialarts/mersina.jpg",
    "title": "Lead Instructor",
    "bio": "<p>Miss Mersina started her journey in Martial Arts at a very young age and quickly advanced through the ranks. Miss Mersina is known for her crisp technique and patience in teaching. She has a passion for forms and weapons, spinning a bo staff with ease. She continues to train for her third degree Black Belt, while teaching incredible classes at both Determination and The Dream Centre as a part of Miss Emily’s team.</p>"
  },
  {
    "ord": 3,
    "category": "martialarts",
    "colour": "blue",
    "name": "Jonathan Shadorsky",
    "photo": "./img/faculty/martialarts/jonathan.jpg",
    "title": "Instructor",
    "bio": "<p>Mr. Jonathan has been a student with Miss Emily since 4 years old, and has been teaching at the Dream Centre with the team for 2 years now. Jonathan went to the World Championships at only 8 years old, defeating numerous opponents to achieve a Silver medal! He continued his competitive journey until he achieved Black Black, and now spends his time focusing on learning complex and intricate forms.</p>"
  },
  {
    "ord": 1,
    "category": "bacare",
    "colour": "yellow",
    "name": "Erika Cantin RECE",
    "photo": "./img/faculty/bacare/erika.jpg",
    "title": "Director of Before & After Care Program",
    "bio": "<p>Erika Cantin graduated from the Early Childhood Education program at Sheridan College and has been in the field of Early Childhood Education for more than 20 years. Her experience includes years of classroom teaching in a variety of ages and stages from parent &amp; infant classes through school aged children, supervising one of the largest school age programs in the Halton area, 8 years as the Director of a Childcare &amp; Montessori School in Oakville and 3 years as a Director of a Childcare centre in Waterdown.</p><p>Erika is a current member and in good standing with the College of Early Childhood Educators (CECE), a member with the Association of Early Childhood Educators Ontario (AECEO). She has her First Aid &amp; CPR certification as well as her safe food handing certificate. She was accepted into the Mentoring Pairs for Childcare Program 2 years in a row receiving credits with Sheridan College.</p><p>Her passion for children, families and community is what brought her to the field of Early Childhood Education and continues to drive her to grow as an educator.</p><p>&quot;I am very excited to be leading The Dream Centre Before &amp; After Care team as well as our Family Tree Program. It is my goal to create a warm, nurturing and educational environment for the children and their families through a sense of community and a positive and inclusive atmosphere.&quot;</p>"
  },
  {
    "ord": 2,
    "category": "bacare",
    "colour": "yellow",
    "name": "Stacy Samothrakis RECE",
    "photo": "./img/faculty/bacare/stacy.jpg",
    "title": "Before & After School Program Early Childhood Educator",
    "bio": "<p>Stacy Samothrakis is a Registered Early Childhood Educator and has been in the field for 21 years. She has experience working with children from birth to school age and worked with children with special needs. Educating children in their early years is a passion of hers, and she truly loves what she does.</p><p>Stacy graduated from the Early Childhood Education program from George Brown College, and began working for the college after her first year, where she continued to work for the next 10 years. Stacy has also worked in various centres in downtown Toronto, Burlington and Waterdown.  She has also worked in a Montessori school and an elementary school running their Kindergarten programs and ran a home daycare for 7 years.</p><p>She has many certificates in the field including food handlers’ certificate and first aid & CPR. Stacy is in good standings with the College of Early Childhood Educators.</p>"
  },
  {
    "ord": 3,
    "category": "bacare",
    "colour": "yellow",
    "name": "Cari Gangaram RECE",
    "photo": "./img/faculty/bacare/cari.jpg",
    "title": "Before & After School Program Early Childhood Educator",
    "bio": "<p>Cari is a graduate of the Early Childhood Education program from Sheridan college.  After 14 years in the field as a teacher of all ages and then in management, Cari moved to Waterdown to open her own licensed childcare center.  For over 10 years Cari was the owner operator of 2 daycares in town that had 130 children.  Cari has 2 children, Taylor & Nicholas.  With over 20 years in the childcare field Cari is enjoying her time with the children here at The Dream Centre.</p>"
  },
  {
    "ord": 1,
    "category": "ninja",
    "colour": "black",
    "name": "Brittany Berezowski",
    "photo": "./img/faculty/ninja/bb.jpg",
    "title": "Gymnastics & Ninja Warrior Director, COO",
    "bio": "<p>Brittany has been coaching gymnastics since 2005 and has had the opportunity to work with gymnasts from beginner to national level. She has also worked with athletes in cheerleading, dance, figure skating delivering specific athletic training needs. She was a judge for the Ontario Developmental Program (ODP) for 7 years. Since 2016, she has expanded her focus towards online education and program development for coaches to be able to provide quality coaching while incorporating a positive mindset. She has held clinics in both US and Canada.</p><p>Brittany has a bachelor’s degree in Applied Science (BASc) and a diploma as a Social Service Worker (SSW). She is also a Certified Personal Trainer through the National Academy Of Sports Medicine (NASM), certified in First Aid/CPR. Brittany studied in a variety of different areas such as sociology, psychology, counselling, and mediation which allows for a higher quality of coaching. She has experience working with children outside of sport as well, such as elementary schools and long-term care homes. She has a substantial amount of experience working with children and adults with exceptional needs.</p><p>Brittany did gymnastics in her youth and then moved into fitness later on in life. She grew up training as an opera singer and travelled US, Canada and Europe to sing. She participated in many operas, broadway productions, musicals, and other performances over the years. In her spare time, she enjoys cooking, doing puzzles and writing.</p><p>As a coach, one of Brittany’s most important values is to always see progress. Whether that be physical or emotional, she does her best to make sure her athletes and coaches are always progressing in some way. Her consistent and positive demand for quality and focus allows her to successfully guide each athlete to reach their highest potential.</p>"
  },

  {
    "ord": 2,
    "category": "ninja",
    "colour": "black",
    "name": "Shannon Cooper",
    "photo": "./img/faculty/ninja/sc.jpg",
    "title": "Recreational & Pre-Competitive Gymnastics Coach, Gym Supervisor",
    "bio": "<p>Shannon has been a coach for over twenty years. She grew up training as a competitive gymnast and Trampolinist. She has been coaching in our recreational and pre-competitive programs at the Dream Centre since 2015.</p><p>Shannon has a College Diploma in Recreation and Leisure Services and her certifications and accomplishments include: Level 1&2 NCCP coaching in Gymnastics, Trampoline and Tumbling. She is also a Registered Reflexologist and Reiki Practitioner. Shannon has a cross trained in a variety of other sports including, dance, cheerleading, soccer, hockey and snowboarding. In her spare time she loves to paint.</p>"
  },
  {
    "ord": 4,
    "category": "ninja",
    "colour": "black",
    "name": "Chloe Henson",
    "photo": "./img/faculty/ninja/chh.jpg",
    "title": "Recreational & Pre-Competitive Gymnastics Coach, Ninja Warrior Coach",
    "bio": "<p>Chloe was a competitive dancer at The Dream Centre from the ages of 7-13. Following competitive dance, she started volunteering in the gymnastics program. Chloe has been an amazing and committed coach since 2017.  She has recently grown into teaching our new Ninja Warrior program as well as our pre-competitive gymnasts.</p><p>Chloe is currently an honours student at Glendale Secondary School in their audition based performing arts program.</p><p>Chloe is a certified gymnastics coach and has attained her First Aid/CPR certification. Chloe’s strong leadership skills bring quality to her classes and help the kids grow and progress throughout the season. Her goal is to put a smile on all of their faces and make sure they have fun. She is excited to grow with the Dream Centre this year.</p>"
  },
  {
    "ord": 5,
    "category": "ninja",
    "colour": "black",
    "name": "Megan Small",
    "photo": "./img/faculty/ninja/ms.jpg",
    "title": "Recreational Gymnastics Coach",
    "bio": "<p>Megan is an honours student at Waterdown District High School. She hopes to study Sciences and/or Sports Management in University. Megan has been a gymnast since she was 3 years old and has been involved in a variety of other sports such as ballet, dance, tennis, rock climbing and other fitness programs. She is also a certified rock climbing coach. She has been coaching gymnastics at the Dream Centre since 2018. Coaching and being a mentor for young children has been a passion of Megan. Her eagerness to learn and inspire shows evidently in her coaching abilities.</p>"
  },
  {
    "ord": 6,
    "category": "ninja",
    "colour": "black",
    "name": "Sarah Visser",
    "photo": "./img/faculty/ninja/sv.jpg",
    "title": "Recreational Gymnastics Coach",
    "bio": "<p>Sarah Visser is a certified gymnastics coach and has been a gymnastics coach for over 20 years. She grew up training as a provincial gymnast and has coached both recreational and competitive levels. Her extensive experience in coaching and outgoing personality allows for a fun but progressive class environment. On her spare time, she loves biking, hiking and spending time with family.</p>"
  },
  {
    "ord": 7,
    "category": "ninja",
    "colour": "black",
    "name": "Carina Ferrazzi",
    "photo": "./img/faculty/ninja/cf.jpg",
    "title": "Recreational Gymnastics Coach",
    "bio": "<p>Carina is a Grade 12 Honour Roll student. She has been dancing and doing tumbling since the age of four. Carina has won scholarships to the Canadian Dance Expo and multiple awards at various competitions.</p><p>Carina has found her passion in coaching gymnastics and has been teaching at The Dream Centre Since 2018. Carina is excited to pursue her career as a gymnastics coach and works hard every day to inspire and mentor the children in her classes. Her excitement for fitness and health has pushed her to see herself coaching long-term.</p>"
  },
  {
    "ord": 8,
    "category": "ninja",
    "colour": "black",
    "name": "Courtney Hirsch",
    "photo": "./img/faculty/ninja/coh.jpg",
    "title": "Recreational Gymnastics Coach",
    "bio": "<p>Courtney is a certified gymnastics and trampoline coach and has been working at the Dream Centre since 2018. She is passionate about teaching and mentoring children. Her outgoing personality brings character and excitement to all of her classes.</p><p>Courtney started out as a competitive gymnast herself and then moved into lyrical dance and circus training on the hoops, silks, hamic and trapeze bars. She has won multiple awards for best tumbling and high scores on each apparatus in gymnastics.</p><p>Courtney graduated with honours at Waterdown District High School. She has volunteered at Allan A Greenleaf School and the Burlington SPCA. On her spare time she enjoys different types of art and loves spending time with her kitten.</p>"
  },
  {
    "ord": 9,
    "category": "ninja",
    "colour": "black",
    "name": "Lauren Inrig",
    "photo": "./img/faculty/ninja/li.jpg",
    "title": "Recreational Gymnastics Coach",
    "bio": "<p>Lauren started training at The Dream Centre around the age of 9 in our competitive dance program. Lauren achieved many goals and awards during her training years. One of her biggest accomplishments was being a part of the World Performers National Team in 2019. She started coaching as an assistant in our gymnastics program in 2019 and is now coaching on her own. While formerly focused on her training as an athlete, Lauren is very excited that she can still grow at The Dream Centre, now as a coach.</p>"
  },
  {
    "ord": 10,
    "category": "ninja",
    "colour": "black",
    "name": "Caitlin Huard",
    "photo": "./img/faculty/ninja/cah.jpg",
    "title": "Recreational & Pre-Competitive Gymnastics Coach",
    "bio": "<p>Caitlin is a grade 12 honours student and is looking forward to pursuing a career in Kinesiology and Physical Education. She started dance at the age of 3 and moved into gymnastics by 5 years old. Caitlin competed as a provincial level gymnast and ever since then it has been her passion. She has placed in top 3 at many competitions.</p><p>Caitlin is an NCCP certified gymnastics coach as well as trained in First Aid/CPR. Caitlin places great emphasis on quality and technique while coaching based on her experience and passion for the sport. She has been coaching at The Dream Centre since 2018 and looks forward for many years to come.</p>"
  },
  {
    "ord": 11,
    "category": "ninja",
    "colour": "black",
    "name": "Martina Chaulk",
    "photo": "./img/faculty/ninja/mc.jpg",
    "title": "Recreational Gymnastics Assistant",
    "bio": "<p>Martina has just started at The Dream Centre as a Recreational Gymnastics Assistant. She is 14 years old and attends St. Mary's High School in Hamilton. Martina has a passion for gymnastics and was part of our pre-competitive gymnastics program when she was younger. She loves working with children and believes that coaching is a great way to continue to share her knowledge and passion with others. She looks forward to an amazing year at The Dream Centre.</p>"
  }
]
